#### PointCloudColorEncoding Enumeration

---

|  |
| --- |
| See Also |

The color encodings supported by Revit point clouds.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum PointCloudColorEncoding ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PointCloudColorEncoding ``` |

| Visual C++ |
| --- |
| ``` public enum class PointCloudColorEncoding ``` |

# Members

| Member name | Description |
| --- | --- |
| ARGB | The point cloud uses colors arranged in ARGB format. |
| ABGR | The point cloud uses colors arranged in ABGR format (common in Windows). |

# See Also

Autodesk.Revit.DB.PointClouds Namespace